Revit 2027 API
PrintParameters.ZoomType Property
 The zoom type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ZoomType ZoomType { get; set; }
Public Property ZoomType As ZoomType
	Get
	Set
public:
property ZoomType ZoomType {
	ZoomType get ();
	void set (ZoomType value);
}
member ZoomType : ZoomType with get, set
Property Value
ZoomType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  Thrown when the input argument is out of range.
See Also
Reference
PrintParameters Class
Autodesk.Revit.DB Namespace